# InsertSymbolInFolder

## Description
Inserts a symbol definition into the referenced symbol folder.

```pascal
PROCEDURE InsertSymbolInFolder(
				targetFolder : HANDLE;
				symbolDef    : HANDLE);
```

```python
def vs.InsertSymbolInFolder(targetFolder, symbolDef):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|targetFolder|HANDLE|Handle to symbol folder.|
|symbolDef|HANDLE|Handle to symbol definition.|

## Version
Availability: from VectorWorks8.5

## Category
* Objects - Symbols